## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.terraform-azure-collection.azurerm_key_vault.key_vault has been deleted
  - resource "azurerm_key_vault" "key_vault" {
      - id                              = "/subscriptions/080291cf-8419-427c-953c-944e6c351029/resourceGroups/gh-rg-nikhil-test-network-acl/providers/Microsoft.KeyVault/vaults/ghkvnikhiltestnetworkacl" -> null
        name                            = "ghkvnikhiltestnetworkacl"
        tags                            = {
            "branch"     = "nikhil-test-network-acl"
            "created_by" = "terraform-ci"
        }
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.terraform-azure-collection.azurerm_key_vault_secret.observe_password has been deleted
  - resource "azurerm_key_vault_secret" "observe_password" {
      - id                      = "https://ghkvnikhiltestnetworkacl.vault.azure.net/secrets/observe-password/334bbb99bc8c443cbe317bb54d7a3e1c" -> null
        name                    = "observe-password"
        tags                    = {}
        # (7 unchanged attributes hidden)
    }

  # module.terraform-azure-collection.azurerm_key_vault_secret.observe_token has been deleted
  - resource "azurerm_key_vault_secret" "observe_token" {
      - id                      = "https://ghkvnikhiltestnetworkacl.vault.azure.net/secrets/observe-token/15b6208b4b03417c889bf83e2ea7dca5" -> null
        name                    = "observe-token"
        tags                    = {}
        # (7 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.terraform-azure-collection.azurerm_key_vault.key_vault will be created
  + resource "azurerm_key_vault" "key_vault" {
      + access_policy                 = (known after apply)
      + id                            = (known after apply)
      + location                      = "centralus"
      + name                          = "ghkvnikhiltestnetworkacl"
      + public_network_access_enabled = true
      + resource_group_name           = "gh-rg-nikhil-test-network-acl"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 90
      + tags                          = {
          + "branch"     = "nikhil-test-network-acl"
          + "created_by" = "terraform-ci"
        }
      + tenant_id                     = "81665909-a4e6-466b-9671-4d9ef491267f"
      + vault_uri                     = (known after apply)

      + contact (known after apply)

      + network_acls (known after apply)
    }

  # module.terraform-azure-collection.azurerm_key_vault_access_policy.app will be created
  + resource "azurerm_key_vault_access_policy" "app" {
      + id                 = (known after apply)
      + key_vault_id       = (known after apply)
      + object_id          = "0ce14b1d-2fd0-44b0-9a1d-5d5fedb7c54d"
      + secret_permissions = [
          + "Backup",
          + "Restore",
          + "Get",
          + "Set",
          + "List",
          + "Delete",
          + "Purge",
        ]
      + tenant_id          = "81665909-a4e6-466b-9671-4d9ef491267f"
    }

  # module.terraform-azure-collection.azurerm_key_vault_access_policy.user will be created
  + resource "azurerm_key_vault_access_policy" "user" {
      + id                 = (known after apply)
      + key_vault_id       = (known after apply)
      + object_id          = "60400f49-81ac-44df-a6a4-218d51ad8fde"
      + secret_permissions = [
          + "Backup",
          + "Restore",
          + "Get",
          + "Set",
          + "List",
          + "Delete",
          + "Purge",
        ]
      + tenant_id          = "81665909-a4e6-466b-9671-4d9ef491267f"
    }

  # module.terraform-azure-collection.azurerm_key_vault_secret.observe_password will be created
  + resource "azurerm_key_vault_secret" "observe_password" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "observe-password"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.terraform-azure-collection.azurerm_key_vault_secret.observe_token will be created
  + resource "azurerm_key_vault_secret" "observe_token" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "observe-token"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.terraform-azure-collection.azurerm_linux_function_app.observe_collect_function_app will be updated in-place
  ~ resource "azurerm_linux_function_app" "observe_collect_function_app" {
      ~ app_settings                                   = {
          - "AZURE_CLIENT_ID"                               = "52c18dde-724c-4799-a820-7c5a0f874c4f"
          - "AZURE_CLIENT_LOCATION"                         = "centralus"
          - "AZURE_CLIENT_SECRET"                           = "@Microsoft.KeyVault(SecretUri=https://ghkvnikhiltestnetworkacl.vault.azure.net/secrets/observe-password/334bbb99bc8c443cbe317bb54d7a3e1c)"
          - "AZURE_TENANT_ID"                               = "81665909-a4e6-466b-9671-4d9ef491267f"
          - "AzureWebJobsDisableHomepage"                   = "true"
          - "EVENTHUB_TRIGGER_FUNCTION_EVENTHUB_CONNECTION" = (sensitive value)
          - "EVENTHUB_TRIGGER_FUNCTION_EVENTHUB_NAME"       = "gh-eh-nikhil-test-network-acl"
          - "FEATURE_FLAGS"                                 = null
          - "OBSERVE_CUSTOMER"                              = "179969258044"
          - "OBSERVE_DOMAIN"                                = "observe-staging.com"
          - "OBSERVE_TOKEN"                                 = "@Microsoft.KeyVault(SecretUri=https://ghkvnikhiltestnetworkacl.vault.azure.net/secrets/observe-token/15b6208b4b03417c889bf83e2ea7dca5)"
          - "WEBSITE_RUN_FROM_PACKAGE"                      = "https://observeinc.s3.us-west-2.amazonaws.com/azure/azure-collection-functions-0.11.4.zip"
          - "timer_resources_func_schedule"                 = "0 */10 * * * *"
          - "timer_vm_metrics_func_schedule"                = "30 */5 * * * *"
        } -> (known after apply)
        id                                             = "/subscriptions/080291cf-8419-427c-953c-944e6c351029/resourceGroups/gh-rg-nikhil-test-network-acl/providers/Microsoft.Web/sites/gh-fa-nikhil-test-network-acl"
        name                                           = "gh-fa-nikhil-test-network-acl"
      ~ tags                                           = {
            "branch"                                         = "nikhil-test-network-acl"
            "created_by"                                     = "terraform-ci"
          - "hidden-link: /app-insights-conn-string"         = "InstrumentationKey=ae661eee-ae94-48c5-99d7-ffb614e2b60d;IngestionEndpoint=https://centralus-0.in.applicationinsights.azure.com/;LiveEndpoint=https://centralus.livediagnostics.monitor.azure.com/;ApplicationId=01dc203b-d360-48e5-ad58-3165eb91326c" -> null
          - "hidden-link: /app-insights-instrumentation-key" = "ae661eee-ae94-48c5-99d7-ffb614e2b60d" -> null
          - "hidden-link: /app-insights-resource-id"         = "/subscriptions/080291cf-8419-427c-953c-944e6c351029/resourceGroups/gh-rg-nikhil-test-network-acl/providers/microsoft.insights/components/observeApplicationInsights" -> null
        }
        # (31 unchanged attributes hidden)

      ~ site_config {
          - application_insights_key                      = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 5 to add, 1 to change, 0 to destroy.
```
</details>